{"id":25592,"date":"2021-12-21T20:28:24","date_gmt":"2021-12-21T14:58:24","guid":{"rendered":"https:\/\/mumbaisharemarkettips.com\/?page_id=25592"},"modified":"2021-12-21T20:41:47","modified_gmt":"2021-12-21T15:11:47","slug":"terms-and-conditions","status":"publish","type":"page","link":"https:\/\/mumbaisharemarkettips.com\/terms-and-conditions\/","title":{"rendered":"Terms and Conditions"},"content":{"rendered":"\t\t<div data-elementor-type=\"wp-page\" data-elementor-id=\"25592\" class=\"elementor elementor-25592\" data-elementor-settings=\"[]\">\n\t\t\t\t\t\t\t<div class=\"elementor-section-wrap\">\n\t\t\t\t\t\t\t<section class=\"elementor-section elementor-top-section elementor-element elementor-element-d833c4a elementor-section-boxed elementor-section-height-default elementor-section-height-default\" data-id=\"d833c4a\" data-element_type=\"section\">\n\t\t\t\t\t\t<div class=\"elementor-container elementor-column-gap-default\">\n\t\t\t\t\t<div class=\"elementor-column elementor-col-100 elementor-top-column elementor-element elementor-element-495fd21\" data-id=\"495fd21\" data-element_type=\"column\">\n\t\t\t<div class=\"elementor-widget-wrap elementor-element-populated\">\n\t\t\t\t\t\t\t\t<div class=\"elementor-element elementor-element-c2686aa elementor-widget elementor-widget-heading\" data-id=\"c2686aa\" data-element_type=\"widget\" data-widget_type=\"heading.default\">\n\t\t\t\t<div class=\"elementor-widget-container\">\n\t\t\t<h2 class=\"elementor-heading-title elementor-size-default\">Terms and Conditions<\/h2>\t\t<\/div>\n\t\t\t\t<\/div>\n\t\t\t\t\t<\/div>\n\t\t<\/div>\n\t\t\t\t\t\t\t<\/div>\n\t\t<\/section>\n\t\t\t\t<section class=\"elementor-section elementor-top-section elementor-element elementor-element-da8b8eb elementor-section-boxed elementor-section-height-default elementor-section-height-default\" data-id=\"da8b8eb\" data-element_type=\"section\">\n\t\t\t\t\t\t<div class=\"elementor-container elementor-column-gap-default\">\n\t\t\t\t\t<div class=\"elementor-column elementor-col-100 elementor-top-column elementor-element elementor-element-3d0be5b\" data-id=\"3d0be5b\" data-element_type=\"column\">\n\t\t\t<div class=\"elementor-widget-wrap elementor-element-populated\">\n\t\t\t\t\t\t\t\t<div class=\"elementor-element elementor-element-f753a62 elementor-widget elementor-widget-text-editor\" data-id=\"f753a62\" data-element_type=\"widget\" data-widget_type=\"text-editor.default\">\n\t\t\t\t<div class=\"elementor-widget-container\">\n\t\t\t\t\t\t\t<p><strong>Disclaimer<\/strong>• The information and views in this website &amp; all the services we provide are believed to be reliable, but we do not accept any responsibility (or liability) for errors of fact or opinion. Users<\/p><ul><li>com has taken due care and caution in compilation of data for its web site. The views and investment tips expressed by investment experts on mumbaisharemarkettips.com are their own, and not that of the website or its management. mumbaisharemarkettips.com advises users to check with certified experts before taking any investment decision. However, mumbaisharemarkettips.com does not guarantee the consistency, adequacy or completeness of any information and is not responsible for any errors or omissions or for the results obtained from the use of such information. mumbaisharemarkettips.com especially states that it has no financial liability whatsoever to any user on account of the use of information provided on its website.<\/li><li>com is not responsible for any errors, omissions or representations on any of our pages or on any links on any of our pages. mumbaisharemarkettips.com does not endorse in anyway any advertisers on our web pages. Please verify the veracity of all information on your own before undertaking any alliance.<\/li><li>The information on this website is updated from time to time. mumbaisharemarkettips.com however excludes any warranties (whether expressed or implied), as to the quality, consistency, efficacy, completeness, performance, fitness or any of the contents of the website, including (but not limited) to any comments, feedback and advertisements contained within the Site.<\/li><li>This website contains material in the form of inputs submitted by users and mumbaisharemarkettips.com accepts no responsibility for the content or consistency of such content nor does mumbaisharemarkettips.com make any representations by virtue of the contents of this website in respect of the existence or availability of any goods and services advertised in the contributory sections. mumbaisharemarkettips.com makes no warranty that the contents of the website are free from infection by viruses or anything else which has contaminating or destructive properties and shall have no liability in respect thereof.<\/li><li>Part of this website contains advertising and other material submitted to us by third parties. Kindly note that those advertisers are responsible for ensuring that material submitted for inclusion on the website complies with all legal requirements. Although acceptance of advertisements on the website is subject to our terms and conditions which are available on request, we do not accept liability in respect of any advertisements.<\/li><li>This website will contain articles contributed by several individuals. The views are exclusively their own and do not necessarily represent the views of the website or its management. The linked sites are not under our control and we are not responsible for the contents of any linked site or any link contained in a linked site, or any changes or updates to such sites. mumbaisharemarkettips.com is providing these links to you only as a convenience, and the inclusion of any link does not imply endorsement by us of the site.<\/li><li>There are risks associated with utilizing internet and short messaging system (SMS) based information and research dissemination services. Subscribers are advised to understand that the services can fail due to failure of hardware, software, and Internet connection. While we ensure that the messages are delivered in time to the subscribers Mobile Network, the delivery of these messages to the customer’s mobile phone\/handset is the responsibility of the customer’s Mobile Network. SMS may be delayed and\/or not delivered to the customer’s mobile phone\/handset on certain days, owing to technical reasons and mumbaisharemarkettips.com cannot be held responsible for the same.<\/li><li>com hereby expressly disclaims any implied warranties imputed by the laws of any jurisdiction. We consider ourselves and intend to be subject to the jurisdiction only of the court of Surat in India. If you don’t agree with any of our disclaimers above please do not read the material on any of our pages. This site is specifically for users in the territory of India. Although the access to users outside India is not denied, mumbaisharemarkettips.com shall have no legal liabilities whatsoever in any laws of any jurisdiction other than India. We reserve the right to make changes to our site and these disclaimers, terms, and conditions at any time.<\/li><li>Stock trading is inherently risky and you agree to assume complete and full responsibility for the outcomes of all trading decisions that you make. All comments and posts made by mumbaisharemarkettips.com is for information purposes only and under no circumstances should be used for actual trading. Under no circumstances should any person at this site make trading decisions based solely on the information discussed herein. We are qualified financial advisor and we provide all the market-based information to keep our clients informed about the real-time changes happening in financial market, complete information provided by us consists of factual information which help you to understand the movement of market through the investment advice we provide. It is completely informative in nature.<\/li><li>You should strictly abide with the consultation provided by the qualified advisors at mumbaisharemarkettips.com and trade only as per the levels provided by us. You agree not to make actual stock trades based on comments on the site, nor on any techniques presented nor discussed in this site or any other form of information presentation. All information is for educational and informational use only. Unlike an actual performance record, simulated results do not represent actual trading. No representation is being made that any account will or is likely to achieve profits or losses similar to those shown.<\/li><li>com operates a real time chat room intended to provide a private forum for users to exchange information and to discuss various investing techniques. You agree, by accessing this or any associated site, mumbaisharemarkettips.com bears no liability for any postings on the website or actions of associate site. We reserve the right to deny service to anyone. You, and not mumbaisharemarkettips.com, assume the entire cost and risk of any trading you choose to undertake. You are solely responsible for making your own investment decisions. If you choose to engage in such transactions with or without seeking advice from a licensed and qualified financial advisor or entity, then such decision and any consequences flowing there from are your sole responsibility. The information and commentaries are not meant to be an endorsement or offering of any stock purchase. They are meant to be a guide only, which must be tempered by the investment experience and independent decision-making process of the subscriber. mumbaisharemarkettips.com or any employees are in no way liable for the use of the information by others in investing or trading in investment vehicles utilizing the principles disclosed herein. The materials and information in, and provided by, this site is not, and should not be construed as an offer to buy or sell any of the securities named in materials, services, or on-line postings as the information shown on website may have a time gap &amp; may be later than the original releasing time of the useful information.<\/li><li>We encourage all investors to use the information on the site as a resource only to further their own research on all featured companies, stocks, sectors, markets and information presented on the site.<\/li><li>com, its management, its associate companies and\/or their employees take no responsibility for the veracity, validity and the correctness of the expert recommendations or other information or research. Although we attempt to research thoroughly on information provided herein, there are no guarantees in consistency. The information presented on the site has been gathered from various sources believed to be providing correct information. mumbaisharemarkettips.com, group, companies, associates and\/or employees are not responsible for errors, inaccuracies if any in the content provided on the site.<\/li><li>com does not represent or endorse the consistency or reliability of any of the information, conversation, or content contained on, distributed through, or linked, downloaded or accessed from any of the services contained on this website (hereinafter, the “Service”), nor the quality of any products, information or other materials displayed, purchased, or obtained by you as a result of any other information or offer by or in connection with the Service.<\/li><li>com has license to provide investment advice. No materials in mumbaisharemarkettips.com, either on behalf of mumbaisharemarkettips.com or any site host, or any participant in mumbaisharemarkettips.com or any of its associated sites should be taken as investment advice directly, indirectly, implicitly, or in any manner whatsoever, including but not limited to trading of stocks on a short term or long-term basis, or trading of any financial instruments whatsoever. Past Performance Is Not an Indicator of Future Returns. All the analyst commentary provided on mumbaisharemarkettips.com is provided for information purposes only. This information is NOT a recommendation or solicitation to buy or sell any securities. Your use of this and all information contained on mumbaisharemarkettips.com is governed by these Terms and Conditions of Use. This material is based upon information that we consider reliable, but we do not represent that it is consistent or complete, and that it should be relied upon, as such. You should not rely solely on the Information in making any investment. Rather, you should use the Information only as a starting point for doing additional independent research in order to allow you to form your own opinion regarding investments. By using mumbaisharemarkettips.com including any software and content contained therein, you agree that use of the Service is entirely at your own risk. mumbaisharemarkettips.com is a registered investment advisor. You understand and acknowledge that there is a very high degree of risk involved in trading securities. Past results of any trader published on this website are not an indicator of future returns by that trader and are not an indicator of future returns which be realized by you. Any information, opinions, advice or offers posted by any person or entity logged in to mumbaisharemarkettips.com or any of its associated sites is to be construed as public conversation only. mumbaisharemarkettips.com makes no warranties and gives no assurances regarding the truth, timeliness, reliability, or good faith of any material posted on mumbaisharemarkettips.com. mumbaisharemarkettips.com does not warranties that trading methods or systems presented in their services or the information herein or obtained from advertisers or members will result in profits or losses.<\/li><li>Any surfing and reading of the information is the acceptance of this disclaimer. All Rights Reserved.<\/li><li>All trades will be exclusively on the specific advice of Mumbai Share Market Tips no advice should be taken from anyone else by the client.<\/li><\/ul><p>have the right to choose the product\/s that suits them the most.<\/p><ul><li>Investment in equity shares has its own risks. Sincere efforts have been made to present the right investment perspective. The information contained herein is based on analysis and on sources that we consider reliable. We, however, do not vouch for the consistency or the completeness thereof. This material is for personal information and we are not responsible for any loss incurred due to it &amp; take no responsibility whatsoever for any financial profits or loss which may arise from the recommendations above.<\/li><li>com does not purport to be an invitation or an offer to buy or sell any financial instrument. Analyst or any person related to mumbaisharemarkettips.com might be holding positions in the stocks recommended.<\/li><li>Our Clients (Paid or Unpaid), Any third party or anyone else have no rights to forward or share our calls or SMS or Reports or Any Information Provided by us to\/with anyone which is received directly or indirectly by them. If found so then Serious Legal Actions can be Taken.<\/li><li>By accessing mumbaisharemarkettips.com or any of its associate\/group sites, you have read, understood and agree to be legally bound by the terms of the following disclaimer and user agreement<\/li><\/ul><p> <\/p>\t\t\t\t\t\t<\/div>\n\t\t\t\t<\/div>\n\t\t\t\t\t<\/div>\n\t\t<\/div>\n\t\t\t\t\t\t\t<\/div>\n\t\t<\/section>\n\t\t\t\t<section class=\"elementor-section elementor-top-section elementor-element elementor-element-5dafdb5 elementor-section-boxed elementor-section-height-default elementor-section-height-default\" data-id=\"5dafdb5\" data-element_type=\"section\">\n\t\t\t\t\t\t<div class=\"elementor-container elementor-column-gap-default\">\n\t\t\t\t\t<div class=\"elementor-column elementor-col-100 elementor-top-column elementor-element elementor-element-e95c365\" data-id=\"e95c365\" data-element_type=\"column\">\n\t\t\t<div class=\"elementor-widget-wrap elementor-element-populated\">\n\t\t\t\t\t\t\t\t<div class=\"elementor-element elementor-element-17d3f54 elementor-widget elementor-widget-text-editor\" data-id=\"17d3f54\" data-element_type=\"widget\" data-widget_type=\"text-editor.default\">\n\t\t\t\t<div class=\"elementor-widget-container\">\n\t\t\t\t\t\t\t<p><strong>Disclosure<\/strong><\/p><p>Mumbai Share Market Tips do not receive any consideration by way of remuneration or compensation or in any other form whatsoever, by us or any of our associates or subsidiaries for any distribution or execution services in respect of the products or securities for which the investment advice is provided to the client.<\/p><p>Mumbai Share Market Tips do not recommend a stock\/commodity broker. If any stock\/commodity broker is recommended by any of our representatives, we do not receive any consideration by way of remuneration or compensation or in any other form whatsoever from stock\/commodity broker or any other intermediary so recommended to client.<\/p><p>To ensure compliance with the Investment Advisor Regulation 2013, we have resolved that the investment advisor and all its representatives will not make any trades in the market. We are not associated in any manner with any issuer of products\/ securities, this ensures that there is no actual or potential conflicts of interest. This also ensures that objectivity or independence in the carrying on of investment advisory services is not compromised. Investment in stock\/commodity markets is subject to market risk, though best attempts are made for predicting markets, but no surety of return or accuracy of any kind is guaranteed, while the performance sheet of various products is available but should not be considered as a guarantee for future performance of the products\/services. Clients are advised to consider all the advice as just an opinion and make investment decisions on their own.<\/p><p>In case of clients seeking advice on any specific positions already made by the client, we will be able to suggest the best possible action considering our view on the security or product. Such suggestion under any circumstances shall be considered as an opinion (not advice) from our organisation and we advice client to consider our opinion and not consultancy to make his\/her final decision. We are not liable for any losses whatsoever client may incur in accepting this opinion.<\/p><p>Client is also advised to trade only if tips suit his current risk appetite and risk bearing capacity, all such tips shall be considered as a view or opinion and client shall on his\/her discretion decide actual trades.<\/p><p>We are not associated with any intermediaries and do not recommend the services of any specific intermediaries.<br \/>No litigations have been filed against us since the incorporation.<\/p><p>All advice is only communicated as written communication, verbal communication with our employees is not encouraged  and to be used only as a contingency if written communication isnt going through for any unforeseen reasons.<\/p><p> <\/p><p><strong>Refund Policy<\/strong><\/p><p>Since we give a 1 days free trial to evaluate our services and support system, we expect that the client is satisfied before making the payment, therefore we, Mumbai Share Market Tips, have no refund policy.<\/p><p>By making the payment for our services we assume that the client has availed our 1 days free trial and read the disclosure and has made the payment only after being satisfied with the quality of services and support from us.<\/p><p>We give our best efforts and are confident about the quality of services that we give. We try to give the same level of services during the trial period as well as after that, therefore there is no refund policy or cancellation of payment.<\/p><p>Before making a decision for subscribing with us go through our website thoroughly. See that all your credit cards and passwords are not disclosed to anyone and no one can pay for your account, and your membership is secured.All advice is only communicated as written communication, verbal communication with our employees is not encouraged  and to be used only as a contingency if written communication isnt going through for any unforeseen reasons.<\/p><p> <\/p>\t\t\t\t\t\t<\/div>\n\t\t\t\t<\/div>\n\t\t\t\t\t<\/div>\n\t\t<\/div>\n\t\t\t\t\t\t\t<\/div>\n\t\t<\/section>\n\t\t\t\t\t\t<\/div>\n\t\t\t\t\t<\/div>\n\t\t","protected":false},"excerpt":{"rendered":"<p>Terms and Conditions Disclaimer• The information and views in this website &amp; all the services we provide are believed to be reliable, but we do not accept any responsibility (or liability) for errors of fact or opinion. Users com has taken due care and caution in compilation of data for its web site. The views &hellip;<\/p>\n<p class=\"read-more\"> <a class=\"\" href=\"https:\/\/mumbaisharemarkettips.com\/terms-and-conditions\/\"> <span class=\"screen-reader-text\">Terms and Conditions<\/span> Read More &raquo;<\/a><\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"site-sidebar-layout":"no-sidebar","site-content-layout":"page-builder","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"disabled","ast-breadcrumbs-content":"","ast-featured-img":"disabled","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":""},"_links":{"self":[{"href":"https:\/\/mumbaisharemarkettips.com\/wp-json\/wp\/v2\/pages\/25592"}],"collection":[{"href":"https:\/\/mumbaisharemarkettips.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/mumbaisharemarkettips.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/mumbaisharemarkettips.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/mumbaisharemarkettips.com\/wp-json\/wp\/v2\/comments?post=25592"}],"version-history":[{"count":7,"href":"https:\/\/mumbaisharemarkettips.com\/wp-json\/wp\/v2\/pages\/25592\/revisions"}],"predecessor-version":[{"id":25601,"href":"https:\/\/mumbaisharemarkettips.com\/wp-json\/wp\/v2\/pages\/25592\/revisions\/25601"}],"wp:attachment":[{"href":"https:\/\/mumbaisharemarkettips.com\/wp-json\/wp\/v2\/media?parent=25592"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}